{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "batch_input_shape": [null, 80, 80, 3], "name": "batchnormalization_1", "momentum": 0.99, "trainable": true, "input_dtype": "float32", "axis": -1, "epsilon": 0.001, "mode": 1}}, {"class_name": "Convolution2D", "config": {"init": "normal", "W_constraint": null, "trainable": true, "subsample": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "bias": true, "name": "convolution2d_1", "nb_col": 5, "activation": "linear", "activity_regularizer": null, "nb_row": 5, "W_regularizer": null, "nb_filter": 24, "b_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "normal", "W_constraint": null, "trainable": true, "subsample": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "bias": true, "name": "convolution2d_2", "nb_col": 5, "activation": "linear", "activity_regularizer": null, "nb_row": 5, "W_regularizer": null, "nb_filter": 36, "b_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "normal", "W_constraint": null, "trainable": true, "subsample": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "bias": true, "name": "convolution2d_3", "nb_col": 5, "activation": "linear", "activity_regularizer": null, "nb_row": 5, "W_regularizer": null, "nb_filter": 48, "b_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "normal", "W_constraint": null, "trainable": true, "subsample": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "bias": true, "name": "convolution2d_4", "nb_col": 3, "activation": "linear", "activity_regularizer": null, "nb_row": 3, "W_regularizer": null, "nb_filter": 64, "b_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "normal", "W_constraint": null, "trainable": true, "subsample": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "bias": true, "name": "convolution2d_5", "nb_col": 3, "activation": "linear", "activity_regularizer": null, "nb_row": 3, "W_regularizer": null, "nb_filter": 64, "b_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_4", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "normal", "output_dim": 1164, "input_dim": 64, "trainable": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_1", "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_5", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"class_name": "Dense", "config": {"init": "normal", "output_dim": 100, "input_dim": 1164, "trainable": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_2", "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_6", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"class_name": "Dense", "config": {"init": "normal", "output_dim": 50, "input_dim": 100, "trainable": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_3", "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_7", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"class_name": "Dense", "config": {"init": "normal", "output_dim": 10, "input_dim": 50, "trainable": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_4", "b_constraint": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_9", "trainable": true}}, {"class_name": "Dense", "config": {"init": "normal", "output_dim": 1, "input_dim": 10, "trainable": true, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "name": "dense_5", "b_constraint": null}}]}